Repository: qazaqninja/niyet
Catalog: lib/src/core/localization/intl/app_*.arb
Languages: ar, kk

# appTitle
source: Niyet
ar: نية
kk: Ниет

source: Home
ar: الرئيسية
kk: Басты бет

source: Calendar
ar: التقويم
kk: Күнтізбе

source: Settings
ar: الإعدادات
kk: Баптаулар

# setNiyet
source: Set Intention
ar: تحديد النية
kk: Ниет қою

# muhasaba
source: Reflection
ar: المحاسبة
kk: Мухасаба

# morningGreeting
source: Good morning
ar: صباح الخير
kk: Қайырлы таң

# eveningGreeting
source: Good evening
ar: مساء الخير
kk: Қайырлы кеш

# setIntentionsForToday
source: Set your intentions for today
ar: حدد نواياك لهذا اليوم
kk: Бүгінгі ниеттеріңізді қойыңыз

source: Time for reflection
ar: وقت المحاسبة
kk: Мухасаба уақыты

# whatIsYourIntention
source: What is your intention today?
ar: ما هي نيتك اليوم؟
kk: Бүгінгі ниетің қандай?

# intentionPlaceholder
source: e.g., Be patient with family
ar: مثلاً: الصبر مع الأهل
kk: Мысалы: Отбасыма шыдамды болу

source: For the sake of Allah
ar: لوجه الله
kk: Алла разылығы үшін

source: Category
ar: الفئة
kk: Санат

# ibadah
source: Worship
ar: عبادة
kk: Ғибадат

# akhlaq
source: Character
ar: أخلاق
kk: Мінез-құлық

source: Family
ar: عائلة
kk: Отбасы

source: Charity
ar: صدقة
kk: Қайырымдылық

source: Work
ar: عمل
kk: Жұмыс

source: Fulfilled
ar: تحققت
kk: Орындалды

source: Tried
ar: حاولت
kk: Тырыстым

source: Missed
ar: فاتت
kk: Өтіп кетті

source: Reflection
ar: تأمل
kk: Ой

# reflectionPlaceholder
source: What helped? What distracted?
ar: ما الذي ساعدك؟ ما الذي شتتك؟
kk: Не көмектесті? Не кедергі болды?

source: Save
ar: حفظ
kk: Сақтау

source: Cancel
ar: إلغاء
kk: Болдырмау

# noIntentionsYet
source: No intentions set yet
ar: لم تحدد نوايا بعد
kk: Әлі ниет қойылмаған

# setYourFirstIntention
source: Set your first intention for today
ar: حدد نيتك الأولى لهذا اليوم
kk: Бүгінге алғашқы ниетіңді қой

# todayIntentions
source: Today's Intentions
ar: نوايا اليوم
kk: Бүгінгі ниеттер

source: Ramadan Mode
ar: وضع رمضان
kk: Рамазан режимі

# hadithReminder
source: Actions are judged by intentions
ar: إنما الأعمال بالنيات
kk: Амалдар ниеттерге байланысты

source: Reflect
ar: تأمل
kk: Мухасаба

source: Evening Reflection
ar: محاسبة المساء
kk: Кешкі мухасаба

source: All intentions reflected
ar: تم تأمل جميع النوايا
kk: Барлық ниеттер қаралды

# mayAllahAccept
source: May Allah accept your efforts
ar: تقبل الله جهودك
kk: Алла еңбектеріңізді қабыл етсін

source: How did it go?
ar: كيف سارت الأمور؟
kk: Қалай өтті?

source: Complete
ar: إتمام
kk: Аяқтау

source: Next
ar: التالي
kk: Келесі

# onboardingWelcomeTitle
source: Welcome to Niyet
ar: مرحباً بك في نية
kk: Ниет қосымшасына қош келдіңіз

# onboardingWelcomeSubtitle
source: Intentions before actions
ar: النية قبل العمل
kk: Алдымен ниет, содан кейін амал

# onboardingConceptTitle
source: Niyet is not a task list
ar: النية ليست قائمة مهام
kk: Ниет - бұл тапсырмалар тізімі емес

# onboardingConceptBody
source: A niyet is an intention you set with purpose. It's not about checking boxes - it's about being mindful of why you act.
ar: النية هي قرار داخلي تتخذه بوعي. ليست عن وضع علامات، بل عن إدراك سبب أفعالك.
kk: Ниет - мақсатпен қойылған ішкі шешім. Тек құсбелгі қою емес, неге әрекет ететініңізді ұғыну.

# onboardingMorningTitle
source: Start your day with intention
ar: ابدأ يومك بنية
kk: Күніңізді ниетпен бастаңыз

# onboardingMorningBody
source: Each morning, set your niyetler for the day. What do you intend to do? For whom? For what purpose?
ar: كل صباح، حدد نواياك لليوم. ماذا تنوي أن تفعل؟ لمن؟ ولماذا؟
kk: Әр таң сайын бүгінгі ниеттеріңізді қойыңыз. Не істемекшісіз? Кім үшін? Қандай мақсатпен?

# onboardingEveningTitle
source: Evening reflection (Muhasaba)
ar: محاسبة المساء
kk: Кешкі мухасаба

# onboardingEveningBody
source: At day's end, reflect on your intentions. Did you fulfill them? What helped? What got in the way? Growth comes through honest reflection.
ar: في نهاية اليوم، تأمل في نواياك. هل حققتها؟ ما الذي ساعدك؟ ما الذي عرقلك؟
kk: Күн соңында ниеттеріңізге ой жүгіртіңіз. Орындай алдыңыз ба? Не көмектесті? Не кедергі болды?

# onboardingGetStartedTitle
source: Begin your journey
ar: ابدأ رحلتك
kk: Жолыңызды бастаңыз

# onboardingGetStartedBody
source: May your intentions be sincere and your efforts blessed.
ar: جعل الله نواياك خالصة وجهودك مباركة.
kk: Ниеттеріңіз ықыласты, еңбектеріңіз берекелі болсын.

# onboardingSkip
source: Skip
ar: تخطي
kk: Өткізу

# onboardingNext
source: Next
ar: التالي
kk: Келесі

# onboardingGetStarted
source: Get Started
ar: ابدأ
kk: Бастау

# noIntentionsForDay
source: No intentions for this day
ar: لا نوايا لهذا اليوم
kk: Бұл күнге ниет жоқ

source: Save as template
ar: حفظ كقالب
kk: Үлгі ретінде сақтау

source: Template saved
ar: تم حفظ القالب
kk: Үлгі сақталды

# templateIbadah1
source: Increase remembrance of Allah
ar: الإكثار من ذكر الله
kk: Алланы еске алуды көбейту

# templateIbadah2
source: Pray on time
ar: الصلاة في وقتها
kk: Намазды уақытында оқу

# templateAkhlaq1
source: Be gentle with people
ar: اللين مع الناس
kk: Адамдарға жұмсақ болу

# templateAkhlaq2
source: Be patient
ar: التحلي بالصبر
kk: Сабырлы болу

# templateFamily1
source: Be good to parents
ar: الإحسان إلى الوالدين
kk: Ата-анаға жақсылық жасау

# templateFamily2
source: Spend time with family
ar: قضاء الوقت مع الأهل
kk: Отбасымен уақыт өткізу

# templateCharity1
source: Give charity secretly
ar: إخفاء الصدقة
kk: Садақаны жасырын беру

# templateCharity2
source: Help someone
ar: مساعدة أحد
kk: Біреуге көмектесу

# templateWork1
source: Work honestly
ar: العمل بأمانة
kk: Адал еңбек ету

# templateWork2
source: Do work excellently
ar: إتقان العمل
kk: Жұмысты жақсы істеу

# deleteNiyet
source: Delete intention
ar: حذف النية
kk: Ниетті өшіру

# deleteNiyetConfirmation
source: Are you sure you want to delete this intention?
ar: هل تريد حذف هذه النية؟
kk: Бұл ниетті өшіргіңіз келе ме?

source: Delete
ar: حذف
kk: Өшіру
